       *> { dg-do run }

       IDENTIFICATION DIVISION.
       PROGRAM-ID. prog.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
          REPOSITORY.
       PROCEDURE DIVISION.
          DISPLAY "OK".

