       *> { dg-do run }

       IDENTIFICATION DIVISION.
       PROGRAM-ID. prog.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
          SOURCE-COMPUTER. a.
          OBJECT-COMPUTER. b.
       PROCEDURE DIVISION.
          DISPLAY "OK".

